bookmarks.md

# Table of Contents

1.  [Bookmarks](#org53c2a6f)
    1.  [What is this about?](#orge20d792)
    2.  [Google certificate course](#org1f7205c)



<a id="org53c2a6f"></a>

# Bookmarks


<a id="orge20d792"></a>

## What is this about?

When I find an interesting article or video, I share it here. Most
of these are possible starting points for a short presentation, or
may be useful for your application research.

I usually look at the articles in some detail (though I rarely work
through them - that would be your job), and assign a label for the
difficulty level Lvl = 0 (simple), 1 (moderate), 2 (difficult), or 3
(hard). Sites or tutorials aren't labeled by difficulty.

Papers can be hard for different reason: length, technical
vocabulary, writing style, mathematics, number of citations etc. If
you find any of these interesting and want to use them for your
research, you might ask me why I assigned a particular level.


<a id="org1f7205c"></a>

## [Google certificate course](https://www.coursera.org/learn/os-power-user/lecture/tVQ51/course-introduction)

Useful to compare this with our syllabus. I've started this course
in November 2021 - not sure yet if I will finish it. 

